//
//  main.c
//  01-二维数组
//
//  Created by apple on 14-2-26.
//  Copyright (c) 2014年 itcast. All rights reserved.
//

#include <stdio.h>


int main(int argc, const char * argv[])
{

//    int age = 10;
//    int age1 = 20
//    。。。。
//    int ages[5] = {22, 13, 14, 15, 16};
//    要求保存一个年级所有班级的年龄
//    int ages2[5] = {22, 13, 14, 15, 16};
//    int ages3[5] ={22, 13, 14, 15, 16};
//    。。。。
//    int ages6[6 * 5] = {22, 13, 14, 15, 16};
    
//    double cs[5];
    
//    格式： 元素类型 数组名称[多少个一维数组][每一个一维数组的元素个数]；
//          元素类型 数组名称[行数][列数]；
//    二维数组也有角标（索引），也是从0开始
//    int ages[2][6] = {
//        {22, 13, 14, 15, 16, 5},//0
//        {22, 13, 14, 15, 16, 8} //1
//    };
    
    char cs[2][3] = {
        {'a', 'b', 'c'},
        {'d', 'e', 'f'}
    };
//    printf("cs = %p\n", cs);
//    printf("cs[0] = %p\n", &cs[0]);
//    printf("cs[1] = %p\n", &cs[1]);
    
//    char temp = cs[1][1];
//    printf("temp = %c\n", temp);
    
    
//    for (int i = 0; i < 3; i++) {
//        printf("%c\n", cs[0][i]);
//    }
    
    /*
//     遍历二维数组
    for (int i = 0; i < 2; i++) {//1
        // i
        for (int j = 0; j < 3; j++) {//1 2
            printf("%c", cs[i][j]);
        }
        printf("\n");
    }
     */
    
//    二维数组的初始化方式
    int a[2][3] = {
        {22, 13, 14},//0
        {22, 13, 14} //1
    };
    
//    按照存储顺序先存储到第一个一维数组中，当存储到第4个的时候就会自动存储到第二个一维数组中
    int b[2][3] = {1, 2, 4, 5, 6, 7};
    
//    部分初始化
    int c[2][3] = {
        {22, 13, 14},//0
        {22} //1
    };
    
    //   因为明确了每一个一维数组的元素个数，当存储到第4个的时候就会自动存储到第二个一维数组中
    int d[][3] = {1, 2, 4, 5, 6, 7};
    
//      搞不清楚每个一维数组中的元素个数
//    int e[2][] = {1, 2, 4, 5, 6, 7};


    
    return 0;
}

